Autodesk.Revit.DB.Electrical.AnalyticalCurrentCalculationData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.AnalyticalCurrentCalculationData.Errors
the errors when running the server

Autodesk.Revit.DB.Electrical.AnalyticalCurrentCalculationData.Report
the calculation report

Autodesk.Revit.DB.Electrical.AnalyticalCurrentCalculationData.Choice
the choice on selecting a calculation service

Autodesk.Revit.DB.Electrical.AnalyticalCurrentCalculationData
The input and output data used by external servers for calculation of Electrical Analytical Distribution System.